<script setup lang="ts">

</script>

<template>
  <div class="vip-rule">
    <div class="title">VIP 规则说明</div>
    <div class="text">
      1.晋级标准：满足VIP晋级要求（即充值或有效投注都满足条件），即可晋级相应VIP等级，获得相应晋级奖金，如连续晋级多级，可获得全部等级晋级奖金，今日00:00:00以后才可领取；<br><br>
      2.日俸禄：每日充值及有效投注满足当前等级日俸禄要求，可获得对应日俸禄奖金，如连续晋级多级，仅可获得当前等级日俸禄奖金，今日00:00:00以后才可领取，当天未领取，奖励过期；<br><br>
      3.周俸禄：每周充值及有效投注满足当前等级周俸禄要求，可获得对应周俸禄奖金，如连续晋级多级，仅可获得当前等级周俸禄奖金，今日00:00:00以后才可领取，本周未领取，奖励过期；<br><br>
      4.月俸禄：每月充值及有效投注满足当前等级月俸禄要求，可获得对应月俸禄奖金，如连续晋级多级，仅可获得当前等级月俸禄奖金，今日00:00:00以后才可领取，本月未领取，奖励过期；<br><br>
      5.奖励过期说明：奖励过期直接作废，请在领取倒计时结束前进行领取；<br><br>6.稽核说明：VIP所赠送的奖金需1倍流水（即稽核、打码或有效投注）才能提现，打码不限游戏平台；<br><br>
      7.活动声明：本功能仅限账号本人进行正常游戏投注，禁止租借账号、无风险投注(对赌、对刷、低赔刷水)、恶意套利、使用外挂程式、机器人、利用协议、漏洞、接口、群控或其他技术手段参与，一经查核属实，本平台有权终止会员登录、暂停会员使用网站、及没收奖金和不当盈利的权利，无需特别通知；<br><br>
      8.解释说明：会员领取VIP奖励时，本平台将默认会员同意且遵守对应条件等相关规定，为避免文字理解歧义，本平台保有本活动最终解释权；<br><br>
    </div>
  </div>
</template>

<style scoped lang="less">
.vip-rule {
  .title {
    height: 45px;
    line-height: 45px;
    margin: 0 10px 10px;
    font-size: 15px;
    color: white;
    border-bottom: 1px solid #242424;
  }
  .text {
    white-space: pre-wrap;
    margin: 0 10px;
    font-size: 13px;
    line-height: 21px;
    padding: 0 5px;
    color: #BCBCBC;
  }
}
</style>